Config/DataProcessors/ПомощникРегистрацииПлательщиковОбразование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПомощникРегистрацииПлательщиковОбразование</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Config/InformationRegisters/ПлательщикиПоДоговоруОбразование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПлательщикиПоДоговоруОбразование</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПорядокВыпискиСФ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокВыпискиСФЗаУслуги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ПорядокВыпискиСФЗаУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПорядокВыпискиСФЗаУслуги</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сводно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПлательщика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ПриказОбразование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриказОбразование</Name>
			<BasedOn>
				<xr:Item>Catalog.Студенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СведенияОПрочихУслугахСтудентам</xr:Item>
				<xr:Item>InformationRegister.СведенияОСтудентах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Факультет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФакультетДокументаДопУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПриказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПриказовОбразование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Студенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПоляПриказовОбразование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ПоляПриказовОбразование</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтудентыДопУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачислениеСтудентамЗаПрочиеУслуги</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НачисленияСтудентамЗаПрочиеУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготыСтудентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Плательщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокВыпискиСФ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядокВыпискиСФЗаУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Documents/РегистрацияПлательщиковПоДоговоруОбразование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РегистрацияПлательщиковПоДоговоруОбразование</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлательщикиПоДоговоруОбразование</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Плательщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокВыпискиСФ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядокВыпискиСФЗаУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/DataProcessors/ПомощникРегистрацииПлательщиковОбразование/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Организация", ОтборОрганизация);
	
	Если Не ЗначениеЗаполнено(ОтборОрганизация) Тогда
		ОтборОрганизация = ЗаполнениеРеквизитовОбъектов.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
	Параметры.Свойство("НаДату", НаДату);
	Если Не ЗначениеЗаполнено(НаДату) Тогда
		НаДату = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоПриказам(Команда)
	
	ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ПослеВыбораПриказа", ЭтотОбъект);
		
	Отбор = Новый Структура();
	Отбор.Вставить("Организация", ОтборОрганизация);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",Истина);
	
	ОткрытьФорму("Документ.ПриказОбразование.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещенияВыбор, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПриказа(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоПриказуНаСервере(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокВыпискиСФ(Команда)
	
	СписокВыпискиСФ = Новый СписокЗначений;
	СписокВыпискиСФ.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокВыпискиСФЗаУслуги.НаПлательщика"));
	СписокВыпискиСФ.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокВыпискиСФЗаУслуги.Сводно"));
	ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ПослеВыбораПорядкаСФ", ЭтотОбъект);
	ПоказатьВыборИзМеню(ОписаниеОповещенияВыбор, СписокВыпискиСФ, Элементы.НаДату);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПорядкаСФ(ВыбранноеЗначение, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаДанныеПлательщиков Из ДанныеПлательщиков Цикл 
		
		СтрокаДанныеПлательщиков.ПорядокВыпискиСФ = ВыбранноеЗначение.Значение;
		СтрокаДанныеПлательщиков.НовыеЗначения = Истина;
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Студент", СтрокаДанныеПлательщиков.Студент);
		СтруктураОтбора.Вставить("Договор", СтрокаДанныеПлательщиков.Договор);
				
		СтрокиРегистрации = Регистрации.НайтиСтроки(СтруктураОтбора);
		
		Для Каждого СтрокаРегистрации Из СтрокиРегистрации Цикл
			СтрокаРегистрации.НовыеЗначения = Истина;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПоУчащемусяСводно(Команда)
	
	ПорядокВыпискиСФ = ПредопределенноеЗначение("Перечисление.ПорядокВыпискиСФЗаУслуги.Сводно");
	УстановитьКонтрагентПоУчащемусяНаСервере(ПорядокВыпискиСФ);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПоУчащемусяНаПлательщика(Команда)
	
	ПорядокВыпискиСФ = ПредопределенноеЗначение("Перечисление.ПорядокВыпискиСФЗаУслуги.НаПлательщика");
	УстановитьКонтрагентПоУчащемусяНаСервере(ПорядокВыпискиСФ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиныйКонтрагент(Команда)
	
	ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ПослеВыбораКонтрагента", ЭтотОбъект);
		
	ПараметрыВыбора = Новый Структура();
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", ПараметрыВыбора, ЭтаФорма,,,, ОписаниеОповещенияВыбор, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКонтрагента(ВыбранноеЗначение, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьЕдиныйКонтрагентНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыРегистрации(Команда)
	
	Перем ТекстСообщения;
	
	Отказ = Ложь;
	ОчиститьСообщения();
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("НовыеЗначения", Истина);
	
	СтрокиДляОбработки = Регистрации.НайтиСтроки(СтруктураОтбора);
	
	Если СтрокиДляОбработки.Количество() = 0 Тогда
		ТекстСообщенияПодробно = НСтр("ru = 'Не отмечены строки для обработки!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияПодробно);
		
		ТекстСообщения = НСтр("ru = 'Формирование документов не выполнялось'");
		Отказ = Истина;
	Иначе
		Для Каждого СтрокаРегистрации Из СтрокиДляОбработки Цикл
			//Плательщики
			СтруктураОтбораРегистрации = Новый Структура;
			СтруктураОтбораРегистрации.Вставить("Студент", СтрокаРегистрации.Студент);
			СтруктураОтбораРегистрации.Вставить("Договор", СтрокаРегистрации.Договор);
			
			СтрокиПлательщиков = ДанныеПлательщиков.НайтиСтроки(СтруктураОтбораРегистрации);
		
			Если СтрокиПлательщиков.Количество() = 0 Тогда
				СообщениеПоДокументу = НСтр("ru = 'По учащемуся %1 и договору %2 не заданы плательщики.'");
				ТекстСообщенияПодробно = СтрШаблон(СообщениеПоДокументу, СтрокаРегистрации.Студент, СтрокаРегистрации.Договор);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияПодробно);
				
				ТекстСообщения = НСтр("ru = 'Формирование документов не выполнялось'");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
	Если НЕ Отказ Тогда
		СоздатьДокументыРегистрацииНаСервере(СтруктураОтбора, Отказ, ТекстСообщения);
	КонецЕсли;	
	
	Если НЕ Отказ Тогда
		ДанныеПлательщиков.Очистить();
		Регистрации.Очистить();
	КонецЕсли;	
	
	ПоказатьПредупреждение(, ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРегистрации

&НаКлиенте
Процедура РегистрацииПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("РегистрацииПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Регистрации.ТекущиеДанные;
	
	Если Поле.Имя = "РегистрацииДокументРегистрации" Тогда
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.ДокументРегистрации) Тогда
			СтандартнаяОбработка = Ложь;
			ПоказатьЗначение(Неопределено, ТекущаяСтрока.ДокументРегистрации);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеПлательщиков

&НаКлиенте
Процедура ДанныеПлательщиковПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ДанныеПлательщиковТекущиеДанные = Элементы.ДанныеПлательщиков.ТекущиеДанные;
	РегистрацииТекущиеДанные = Элементы.Регистрации.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		ЗаполнитьЗначенияСвойств(ДанныеПлательщиковТекущиеДанные, РегистрацииТекущиеДанные, "Студент, Договор");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПлательщиковПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрокаРегистрации = Элементы.Регистрации.ТекущиеДанные;
	
	Если ТекущаяСтрокаРегистрации <> Неопределено Тогда
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Студент", ТекущаяСтрокаРегистрации.Студент);
		СтруктураОтбора.Вставить("Договор", ТекущаяСтрокаРегистрации.Договор);
		
		СтрокиРегистрации = ДанныеПлательщиков.НайтиСтроки(СтруктураОтбора);
		
		Если СтрокиРегистрации.Количество() = 1 И ЗначениеЗаполнено(ТекущаяСтрокаРегистрации.ДокументРегистрации) Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для существующей регистрации не может быть удален единственный плательщик. 
			|В этом случае следует редактировать исходные документы.'"),,"ДанныеПлательщиков",, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПлательщиковПослеУдаления(Элемент)
	
	ТекущиеДанныеРегистрации = Элементы.Регистрации.ТекущиеДанные;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Студент", ТекущиеДанныеРегистрации.Студент);
	СтруктураОтбора.Вставить("Договор", ТекущиеДанныеРегистрации.Договор);
	
	ПересчитатьДолиОплаты(СтруктураОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПлательщиковДоляОплатыПриИзменении(Элемент)
	
	ТекущиеДанныеРегистрации = Элементы.Регистрации.ТекущиеДанные;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Студент", ТекущиеДанныеРегистрации.Студент);
	СтруктураОтбора.Вставить("Договор", ТекущиеДанныеРегистрации.Договор);
	
	ПересчитатьСуммыОплаты(СтруктураОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПлательщиковСуммаОплатыПриИзменении(Элемент)
	
	ТекущиеДанныеРегистрации = Элементы.Регистрации.ТекущиеДанные;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Студент", ТекущиеДанныеРегистрации.Студент);
	СтруктураОтбора.Вставить("Договор", ТекущиеДанныеРегистрации.Договор);
	
	ПересчитатьДолиОплаты(СтруктураОтбора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОповещений

&НаКлиенте
Процедура РегистрацииПриАктивизацииСтрокиОбработчикОжидания()
	
	ТекущаяСтрокаРегистрации = Элементы.Регистрации.ТекущиеДанные;
	
	Если ТекущаяСтрокаРегистрации <> Неопределено Тогда
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Студент", ТекущаяСтрокаРегистрации.Студент);
		СтруктураОтбора.Вставить("Договор", ТекущаяСтрокаРегистрации.Договор);
		
		Элементы.ДанныеПлательщиков.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПлательщиковПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущаяСтрокаДанныеПлательщиков = Элементы.ДанныеПлательщиков.ТекущиеДанные;
	ТекущаяСтрокаДанныеПлательщиков.НовыеЗначения = Истина;
	
	ТекущаяСтрокаРегистрации = Элементы.Регистрации.ТекущиеДанные;
	ТекущаяСтрокаРегистрации.НовыеЗначения = Истина;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоПриказуНаСервере(ПриказыОснование)
	
	Регистрации.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПриказОбразованиеСтуденты.Студент КАК Студент,
		|	ПриказОбразованиеСтуденты.Договор КАК Договор
		|ПОМЕСТИТЬ СтудентыДоговорыПриказа
		|ИЗ
		|	Документ.ПриказОбразование.Студенты КАК ПриказОбразованиеСтуденты
		|ГДЕ
		|	ПриказОбразованиеСтуденты.Ссылка В (&ПриказыОбразование)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтудентыДоговорыПриказа.Студент КАК Студент,
		|	СтудентыДоговорыПриказа.Договор КАК Договор,
		|	ПлательщикиПоДоговоруОбразованиеСрезПоследних.Регистратор КАК ДокументРегистрации,
		|	ПлательщикиПоДоговоруОбразованиеСрезПоследних.Контрагент КАК Контрагент,
		|	ПлательщикиПоДоговоруОбразованиеСрезПоследних.ПорядокВыпискиСФ КАК ПорядокВыпискиСФ,
		|	ПлательщикиПоДоговоруОбразованиеСрезПоследних.ДоляОплаты КАК ДоляОплаты
		|ПОМЕСТИТЬ СтудентыПлательщикиПодготовка
		|ИЗ
		|	СтудентыДоговорыПриказа КАК СтудентыДоговорыПриказа
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлательщикиПоДоговоруОбразование.СрезПоследних(&НаДату, Организация = &Организация) КАК ПлательщикиПоДоговоруОбразованиеСрезПоследних
		|		ПО СтудентыДоговорыПриказа.Студент = ПлательщикиПоДоговоруОбразованиеСрезПоследних.Студент
		|			И СтудентыДоговорыПриказа.Договор = ПлательщикиПоДоговоруОбразованиеСрезПоследних.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтудентыПлательщикиПодготовка.Студент КАК Студент,
		|	СтудентыПлательщикиПодготовка.Договор КАК Договор,
		|	СтудентыПлательщикиПодготовка.ДокументРегистрации КАК ДокументРегистрации,
		|	ТИПЗНАЧЕНИЯ(СтудентыПлательщикиПодготовка.ДокументРегистрации) = ТИП(Документ.РегистрацияПлательщиковПоДоговоруОбразование) КАК ДокументРегистрацияПлательщиков
		|ИЗ
		|	СтудентыПлательщикиПодготовка КАК СтудентыПлательщикиПодготовка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтудентыПлательщикиПодготовка.Студент КАК Студент,
		|	СтудентыПлательщикиПодготовка.Договор КАК Договор,
		|	СтудентыПлательщикиПодготовка.Контрагент КАК Контрагент,
		|	СтудентыПлательщикиПодготовка.ПорядокВыпискиСФ КАК ПорядокВыпискиСФ,
		|	СтудентыПлательщикиПодготовка.ДоляОплаты КАК ДоляОплаты
		|ИЗ
		|	СтудентыПлательщикиПодготовка КАК СтудентыПлательщикиПодготовка
		|ГДЕ
		|	НЕ СтудентыПлательщикиПодготовка.ДокументРегистрации ЕСТЬ NULL";
	
	Запрос.Параметры.Вставить("ПриказыОбразование", ПриказыОснование);
	Запрос.Параметры.Вставить("НаДату", НаДату);
	Запрос.Параметры.Вставить("Организация", ОтборОрганизация);
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	РезультатТаблицаРегистрации = ПакетРезультатовЗапроса[2].Выгрузить();
   	Регистрации.Загрузить(РезультатТаблицаРегистрации);
	
	Если РезультатТаблицаРегистрации.Найти(Истина, "ДокументРегистрацияПлательщиков") = Неопределено Тогда
		//Документов по регистрации ранее не создавалось, устанавливаем способ формирования "Создавать новые".
		СпособСозданияДокументов = 1;
	КонецЕсли;
	
	ДанныеПлательщиков.Загрузить(ПакетРезультатовЗапроса[3].Выгрузить());	
		
КонецПроцедуры

&НаСервере
Процедура УстановитьКонтрагентПоУчащемусяНаСервере(ПорядокВыпискиСФ)
	
	ДанныеПлательщиков.Очистить();
	
	Для Каждого СтрокаРегистрации Из Регистрации Цикл 
		
		СтрокаРегистрации.НовыеЗначения = Истина;
		
		СтрокаПлательщики = ДанныеПлательщиков.Добавить();
		
		СтрокаПлательщики.НовыеЗначения = Истина;
		СтрокаПлательщики.Студент = СтрокаРегистрации.Студент;
		СтрокаПлательщики.Договор = СтрокаРегистрации.Договор;
		
		СтрокаПлательщики.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРегистрации.Студент, "Контрагент");
		СтрокаПлательщики.ПорядокВыпискиСФ = ПорядокВыпискиСФ;
		СтрокаПлательщики.ДоляОплаты = 100;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьЕдиныйКонтрагентНаСервере(ЕдиныйКонтрагент)
	
	ДанныеПлательщиков.Очистить();
	
	Для Каждого СтрокаРегистрации Из Регистрации Цикл 
		
		СтрокаРегистрации.НовыеЗначения = Истина;
		
		СтрокаПлательщики = ДанныеПлательщиков.Добавить();
		
		СтрокаПлательщики.НовыеЗначения = Истина;
		СтрокаПлательщики.Студент = СтрокаРегистрации.Студент;
		СтрокаПлательщики.Договор = СтрокаРегистрации.Договор;
		
		СтрокаПлательщики.Контрагент = ЕдиныйКонтрагент;
		СтрокаПлательщики.ПорядокВыпискиСФ = ПредопределенноеЗначение("Перечисление.ПорядокВыпискиСФЗаУслуги.НаПлательщика");
		СтрокаПлательщики.ДоляОплаты = 100;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДолиОплаты(СтруктураОтбора)
	
	ИтогСуммаОплаты = 0;
	
	СтрокиДляПересчета = ДанныеПлательщиков.НайтиСтроки(СтруктураОтбора);
	
	МассивКоэффициентов = Новый Массив;
	Для Каждого СтрокаТаблицы Из СтрокиДляПересчета Цикл
		МассивКоэффициентов.Добавить(СтрокаТаблицы.СуммаОплаты);
		ИтогСуммаОплаты = ИтогСуммаОплаты + СтрокаТаблицы.СуммаОплаты;
	КонецЦикла;
	
	Если ИтогСуммаОплаты = 0 Тогда 
		Возврат;
	КонецЕсли;	
	
	МассивДолиОплаты = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
		100, МассивКоэффициентов, 4); // Распределим 100% пропорционально введенным суммам оплаты.
	Для Инд = 0 По МассивКоэффициентов.Количество() - 1 Цикл
		СтрокаТаблицы = СтрокиДляПересчета[Инд];
		СтрокаТаблицы.ДоляОплаты = ?(МассивДолиОплаты = Неопределено, 0, МассивДолиОплаты[Инд]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммыОплаты(СтруктураОтбора)
	
	СтрокиДляПересчета = ДанныеПлательщиков.НайтиСтроки(СтруктураОтбора);
	
	ИтогСуммаОплаты = 0;
	МассивКоэффициентов = Новый Массив;
	Для Каждого СтрокаТаблицы Из СтрокиДляПересчета Цикл
		МассивКоэффициентов.Добавить(СтрокаТаблицы.ДоляОплаты);
		ИтогСуммаОплаты = ИтогСуммаОплаты+СтрокаТаблицы.СуммаОплаты;
	КонецЦикла;
	
	МассивСуммОплаты = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
		ИтогСуммаОплаты, МассивКоэффициентов); // Распределим общую сумму оплаты пропорционально введенным долям оплаты.
	Для Инд = 0 По МассивКоэффициентов.Количество() - 1 Цикл
		СтрокаТаблицы = СтрокиДляПересчета[Инд];
		СтрокаТаблицы.СуммаОплаты = ?(МассивСуммОплаты = Неопределено, 0, МассивСуммОплаты[Инд]);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыРегистрацииНаСервере(СтруктураОтбора, Отказ, ТекстСообщения = "")
	
	НачатьТранзакцию();
	
	СтрокиДляОбработки = Регистрации.НайтиСтроки(СтруктураОтбора);
	
	КоличествоИзменено = 0;
	КоличествоСоздано = 0;	
	
	Для Каждого СтрокаРегистрации Из СтрокиДляОбработки Цикл
		
		//Плательщики
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Студент", СтрокаРегистрации.Студент);
		СтруктураОтбора.Вставить("Договор", СтрокаРегистрации.Договор);
		
		Если СпособСозданияДокументов = 0 
			И ЗначениеЗаполнено(СтрокаРегистрации.ДокументРегистрации)
			И СтрокаРегистрации.ДокументРегистрацияПлательщиков Тогда
			
			ДокументОбъект = СтрокаРегистрации.ДокументРегистрации.ПолучитьОбъект();
			ДокументОбъект.Плательщики.Очистить();
			
			КоличествоИзменено = КоличествоИзменено+1;
			
		Иначе
		    ДокументОбъект = Документы.РегистрацияПлательщиковПоДоговоруОбразование.СоздатьДокумент();
			
			ДокументОбъект.Дата = НаДату;
			ДокументОбъект.Организация = ОтборОрганизация;
			ЗаполнитьЗначенияСвойств(ДокументОбъект, СтрокаРегистрации);
			
			КоличествоСоздано = КоличествоСоздано+1;
			
		КонецЕсли;
		
		ДокументОбъект.Комментарий = НСтр("ru = 'Документ сформирован помощником регистрации плательщиков'");
				
		СтрокиПлательщиков = ДанныеПлательщиков.НайтиСтроки(СтруктураОтбора);
		Для Каждого СтрокаПлательщик Из СтрокиПлательщиков Цикл
			НоваяСтрока = ДокументОбъект.Плательщики.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПлательщик, "Контрагент, ПорядокВыпискиСФ, ДоляОплаты, СуммаОплаты");
		КонецЦикла;
		
		ЗаписатьДокумент(ДокументОбъект, Отказ);
		
		Если Отказ Тогда
			СообщениеПоДокументу = НСтр("ru = 'Невозможно провести документ по учащемуся %1 и договору %2.'");
			ТекстСообщения = СтрШаблон(СообщениеПоДокументу, СтрокаРегистрации.Студент, СтрокаРегистрации.Договор);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;	
	
	Если Отказ Тогда
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
	Иначе
		ЗафиксироватьТранзакцию();
		СообщениеОбщее = НСтр("ru = 'Создано новых документов - %1
							|Изменено существующих документов - %2'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеОбщее, КоличествоСоздано, КоличествоИзменено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДокумент(ЗаписываемыйДокумент, Отказ)
	
	Попытка
		ЗаписываемыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	Исключение
		ОписаниеОшибки = ИнформацияОбОшибке();
		
		ОтменитьТранзакцию();
		
		МетаданныеОбъекта = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(
			ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ЗаписываемыйДокумент)));
		
		ЗаписьЖурналаРегистрации("Помощник регистрации плательщиков (образование).Запись",
								УровеньЖурналаРегистрации.Ошибка,
								МетаданныеОбъекта,
								,
								ПодробноеПредставлениеОшибки(ОписаниеОшибки));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ОписаниеОшибки));
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
